[RHEA - win_admin_share_access]
search = index=* (source="WinEventLog:Security" (EventCode="5140" ShareName="Admin$") NOT (SubjectUserName="*$"))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_ad_user_enumeration]
search = index=* (source="WinEventLog:Security" (EventCode="4662" (ObjectType="*bf967aba-0de6-11d0-a285-00aa003049e2*")) NOT (SubjectUserName="*$" OR SubjectUserName="MSOL_*"))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_dcsync]
search = index=* (source="WinEventLog:Security" ((EventCode="4662" (Properties="*Replicating Directory Changes All*" OR Properties="*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*")) NOT (SubjectDomainName="Window Manager")) NOT ((SubjectUserName="NT AUTHORITY*" OR SubjectUserName="*$" OR SubjectUserName="MSOL_*")))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_malware_emotet]
search = index=* (CommandLine="* -e* PAA*" OR CommandLine="*JABlAG4AdgA6AHUAcwBlAHIAcAByAG8AZgBpAGwAZQ*" OR CommandLine="*QAZQBuAHYAOgB1AHMAZQByAHAAcgBvAGYAaQBsAGUA*" OR CommandLine="*kAGUAbgB2ADoAdQBzAGUAcgBwAHIAbwBmAGkAbABlA*" OR CommandLine="*IgAoACcAKgAnACkAOwAkA*" OR CommandLine="*IAKAAnACoAJwApADsAJA*" OR CommandLine="*iACgAJwAqACcAKQA7ACQA*" OR CommandLine="*JABGAGwAeAByAGgAYwBmAGQ*") | table CommandLine,ParentCommandLine
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_malware_ryuk]
search = index=* (CommandLine="*Microsoft\\Windows\\CurrentVersion\\Run*" CommandLine="*C:\\users\\Public\\*") | table CommandLine,ParentCommandLine
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_mimikatz_command_line]
search = index=* ((CommandLine="*DumpCreds*" OR CommandLine="*invoke-mimikatz*") OR ((CommandLine="*rpc*" OR CommandLine="*token*" OR CommandLine="*crypto*" OR CommandLine="*dpapi*" OR CommandLine="*sekurlsa*" OR CommandLine="*kerberos*" OR CommandLine="*lsadump*" OR CommandLine="*privilege*" OR CommandLine="*process*") (CommandLine="*::*")))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_office_shell]
search = index=* ((ParentImage="*\\WINWORD.EXE" OR ParentImage="*\\EXCEL.EXE" OR ParentImage="*\\POWERPNT.exe" OR ParentImage="*\\MSPUB.exe" OR ParentImage="*\\VISIO.exe" OR ParentImage="*\\OUTLOOK.EXE" OR ParentImage="*\\MSACCESS.EXE" OR ParentImage="*\\EQNEDT32.EXE") (Image="*\\cmd.exe" OR Image="*\\powershell.exe" OR Image="*\\wscript.exe" OR Image="*\\cscript.exe" OR Image="*\\sh.exe" OR Image="*\\bash.exe" OR Image="*\\scrcons.exe" OR Image="*\\schtasks.exe" OR Image="*\\regsvr32.exe" OR Image="*\\hh.exe" OR Image="*\\wmic.exe" OR Image="*\\mshta.exe" OR Image="*\\rundll32.exe" OR Image="*\\msiexec.exe" OR Image="*\\forfiles.exe" OR Image="*\\scriptrunner.exe" OR Image="*\\mftrace.exe" OR Image="*\\AppVLP.exe" OR Image="*\\svchost.exe" OR Image="*\\msbuild.exe")) | table CommandLine,ParentCommandLine
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_pass_the_hash]
search = index=* (source="WinEventLog:Security" (LogonType="3" LogonProcessName="NtLmSsp" WorkstationName="%Workstations%" ComputerName="%Workstations%" (EventCode="4624" OR EventCode="4625")) NOT (AccountName="ANONYMOUS LOGON"))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_powershell_download]
search = index=* (Image="*\\powershell.exe" (CommandLine="*new-object system.net.webclient).downloadstring(*" OR CommandLine="*new-object system.net.webclient).downloadfile(*" OR CommandLine="*new-object net.webclient).downloadstring(*" OR CommandLine="*new-object net.webclient).downloadfile(*")) | table CommandLine,ParentCommandLine
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_rdp_reverse_tunnel]
search = index=* (source="WinEventLog:Security" EventCode="5156" ((SourcePort="3389" (DestinationAddress="127.*" OR DestinationAddress="::1")) OR (DestinationPort="3389" (SourceAddress="127.*" OR SourceAddress="::1"))))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_susp_eventlog_clear]
search = index=* (((Image="*\\powershell.exe" (CommandLine="*Clear-EventLog*" OR CommandLine="*Remove-EventLog*" OR CommandLine="*Limit-EventLog*")) OR (Image="*\\wmic.exe" CommandLine="* ClearEventLog *")) OR (Image="*\\wevtutil.exe" (CommandLine="*clear-log*" OR CommandLine="* cl *" OR CommandLine="*set-log*" OR CommandLine="* sl *")))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_susp_psexec]
search = index=* (source="WinEventLog:Security" (EventCode="5145" ShareName="\\*\\IPC$" (RelativeTargetName="*-stdin" OR RelativeTargetName="*-stdout" OR RelativeTargetName="*-stderr")) NOT (EventCode="5145" ShareName="\\*\\IPC$" RelativeTargetName="PSEXESVC*"))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_susp_sam_dump]
search = index=* (source="WinEventLog:System" EventCode="16" (Message="*\\AppData\\Local\\Temp\\SAM-*.dmp *"))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_susp_schtask_creation]
search = index=* ((Image="*\\schtasks.exe" CommandLine="* /create *") NOT (User="NT AUTHORITY\\SYSTEM")) | table CommandLine,ParentCommandLine
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_non_interactive_powershell]
search = index=* (Image="*\\powershell.exe" NOT (ParentImage="*\\explorer.exe"))
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1

[RHEA - win_susp_net_execution]
search = index=* ((Image="*\\net.exe" OR Image="*\\net1.exe") (CommandLine="* group*" OR CommandLine="* localgroup*" OR CommandLine="* user*" OR CommandLine="* view*" OR CommandLine="* share" OR CommandLine="* accounts*" OR CommandLine="* use*" OR CommandLine="* stop *")) | table ComputerName,User,CommandLine,ParentCommandLine
enableSched = 1
cron_schedule = */15 * * * *
counttype = always
action.email = 1
action.email.to = admin@localhost.com
action.email.sendresults = 1
